# Spark - Exercício prático

Este notebook contém o exercício prático de Spark usando python. Você pode realizá-lo localmente em sua máquina (se estiver utilizando Linux) ou subir o código no Google Colab. Se estiver usando Windows, verifique o doc [2-2-spark-exercicios](2-2-spark-exercicios.md) para um tutorial de instalação do Spark no Windows.

## Configuração do ambiente. 

As próximos células fazem a instalação e configuração do java-8 e do spark em sua máquina.

In [1]:
%%bash

# Instal Java
apt-get install openjdk-8-jdk-headless -qq > /dev/null

# Install PySpark
pip install -q pyspark

In [2]:
import os
os.environ['JAVA_HOME'] = '/usr/lib/jvm/java-8-openjdk-amd64'

from pyspark.sql import SparkSession

spark = SparkSession.builder.master("local[*]").getOrCreate()

## 01 - Leitura de dados

Para começar, faça a leitura do arquivo `titanic.csv` para o ambiente spark. Algumas informações importantes:

- O arquivo tem ";" como separador,
- O arquivo possui os nomes das colunas na primeira linha,
- O arquivo deve ser lido com os tipos corretos.

In [3]:
url = "https://raw.githubusercontent.com/neylsoncrepalde/titanic_data_with_semicolon/main/titanic.csv"

# Desenvolva seu código de leitura aqui:

from pyspark.sql import SparkSession
from pyspark import SparkFiles

spark = SparkSession.builder.master('local[*]').appName('Classify Urls').getOrCreate()
url = "https://raw.githubusercontent.com/neylsoncrepalde/titanic_data_with_semicolon/main/titanic.csv"
spark.sparkContext.addFile(url)
df_titanic = spark.read.csv('file:///'+SparkFiles.get('titanic.csv'), header=True, sep=';')

## 02 - Algumas análises preliminares

Exiba na tela:

1) O schema da tabela
2) Os 10 primeiros casos
3) Apenas as pessoas que sobreviveram
4) Apenas as pessoas que não sobreviveram e eram do sexo masculino
5) A média de tarifa paga para cada classe
6) A média de tarifa paga para cada classe e sexo
7) Número de sobreviventes por classe e sexo
8) Número de sobreviventes por sexo e categorias de idade (as categorias de idade devem ser construídas como: abaixo de 18 = criança, entre 18 e 40 = jovem adulto, maior de 40 = adulto maduro).

In [4]:
# 1)
# Desenvolva sua resposta aqui:
df_titanic.schema
df_titanic.printSchema()

root
 |-- PassengerId: string (nullable = true)
 |-- Survived: string (nullable = true)
 |-- Pclass: string (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: string (nullable = true)
 |-- SibSp: string (nullable = true)
 |-- Parch: string (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: string (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [5]:
# 2)
# Desenvolva sua resposta aqui:
df_titanic.show(10)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 10 rows

In [6]:
# 3)
# Desenvolva sua resposta aqui:
df_titanic.filter('Survived=1').show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+--------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|    Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+--------+-----+--------+
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599| 71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|   7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|    53.1| C123|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742| 11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736| 30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|    16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|   26.55| C103|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|    16.0| null|       S|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|    13.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|   7.225| null|       C|
|         22|       1|     2|Beesley, Mr. Lawr...|  male|34.0|    0|    0|          248698|    13.0|  D56|       S|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|          330923|  8.0292| null|       Q|
|         24|       1|     1|Sloper, Mr. Willi...|  male|28.0|    0|    0|          113788|    35.5|   A6|       S|
|         26|       1|     3|Asplund, Mrs. Car...|female|38.0|    1|    5|          347077| 31.3875| null|       S|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|          330959|  7.8792| null|       Q|
|         32|       1|     1|Spencer, Mrs. Wil...|female|null|    1|    0|        PC 17569|146.5208|  B78|       C|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|          335677|    7.75| null|       Q|
|         37|       1|     3|    Mamee, Mr. Hanna|  male|null|    0|    0|            2677|  7.2292| null|       C|
|         40|       1|     3|Nicola-Yarred, Mi...|female|14.0|    1|    0|            2651| 11.2417| null|       C|
|         44|       1|     2|Laroche, Miss. Si...|female| 3.0|    1|    2|   SC/Paris 2123| 41.5792| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+--------+-----+--------+
only showing top 20 rows

In [7]:
# 4)
# Desenvolva sua resposta aqui:
df_titanic.filter("Survived='0' and sex='male'").show()

+-----------+--------+------+--------------------+----+----+-----+-----+---------------+-------+-----------+--------+
|PassengerId|Survived|Pclass|                Name| Sex| Age|SibSp|Parch|         Ticket|   Fare|      Cabin|Embarked|
+-----------+--------+------+--------------------+----+----+-----+-----+---------------+-------+-----------+--------+
|          1|       0|     3|Braund, Mr. Owen ...|male|22.0|    1|    0|      A/5 21171|   7.25|       null|       S|
|          5|       0|     3|Allen, Mr. Willia...|male|35.0|    0|    0|         373450|   8.05|       null|       S|
|          6|       0|     3|    Moran, Mr. James|male|null|    0|    0|         330877| 8.4583|       null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|male|54.0|    0|    0|          17463|51.8625|        E46|       S|
|          8|       0|     3|Palsson, Master. ...|male| 2.0|    3|    1|         349909| 21.075|       null|       S|
|         13|       0|     3|Saundercock, Mr. ...|male|20.0|    0|    0|      A/5. 2151|   8.05|       null|       S|
|         14|       0|     3|Andersson, Mr. An...|male|39.0|    1|    5|         347082| 31.275|       null|       S|
|         17|       0|     3|Rice, Master. Eugene|male| 2.0|    4|    1|         382652| 29.125|       null|       Q|
|         21|       0|     2|Fynney, Mr. Joseph J|male|35.0|    0|    0|         239865|   26.0|       null|       S|
|         27|       0|     3|Emir, Mr. Farred ...|male|null|    0|    0|           2631|  7.225|       null|       C|
|         28|       0|     1|Fortune, Mr. Char...|male|19.0|    3|    2|          19950|  263.0|C23 C25 C27|       S|
|         30|       0|     3| Todoroff, Mr. Lalio|male|null|    0|    0|         349216| 7.8958|       null|       S|
|         31|       0|     1|Uruchurtu, Don. M...|male|40.0|    0|    0|       PC 17601|27.7208|       null|       C|
|         34|       0|     2|Wheadon, Mr. Edwa...|male|66.0|    0|    0|     C.A. 24579|   10.5|       null|       S|
|         35|       0|     1|Meyer, Mr. Edgar ...|male|28.0|    1|    0|       PC 17604|82.1708|       null|       C|
|         36|       0|     1|Holverson, Mr. Al...|male|42.0|    1|    0|         113789|   52.0|       null|       S|
|         38|       0|     3|Cann, Mr. Ernest ...|male|21.0|    0|    0|     A./5. 2152|   8.05|       null|       S|
|         43|       0|     3| Kraeff, Mr. Theodor|male|null|    0|    0|         349253| 7.8958|       null|       C|
|         46|       0|     3|Rogers, Mr. Willi...|male|null|    0|    0|S.C./A.4. 23567|   8.05|       null|       S|
|         47|       0|     3|   Lennon, Mr. Denis|male|null|    1|    0|         370371|   15.5|       null|       Q|
+-----------+--------+------+--------------------+----+----+-----+-----+---------------+-------+-----------+--------+
only showing top 20 rows

In [8]:
# 5)
# Desenvolva sua resposta aqui:
from pyspark.sql.functions import col

# Para converter todo o dataframe:
#df_titanic.select(*(col(Fare).cast('numeric').alias(Fare) for Fare in df_titanic.columns)).printSchema()

# Para converter somente a coluna requisitada:
df_titanic = df_titanic.withColumn('Fare', col('Fare').cast('float')) # para exibir >> .printSchema()
df_titanic.groupBy('Pclass').avg('Fare').show(10)

+------+------------------+
|Pclass|         avg(Fare)|
+------+------------------+
|     3|13.675550210257411|
|     1| 84.15468752825701|
|     2| 20.66218318109927|
+------+------------------+

In [9]:
# 6)
# Desenvolva sua resposta aqui:
df_titanic.groupBy('Pclass','Sex').avg('Fare').show(10)

+------+------+------------------+
|Pclass|   Sex|         avg(Fare)|
+------+------+------------------+
|     2|female|21.970121095055028|
|     2|  male|19.741782426834106|
|     3|  male|12.661632678007186|
|     1|  male| 67.22612723366159|
|     1|female|106.12579769783832|
|     3|female|16.118809819221497|
+------+------+------------------+

In [12]:
# 7)
# Desenvolva sua resposta aqui:
df_titanic = df_titanic.withColumn('Survived', col('Survived').cast('float')) # para exibir >> .printSchema()
df_titanic.groupBy('Pclass', 'Sex').sum('Survived').show(10)

+------+------+-------------+
|Pclass|   Sex|sum(Survived)|
+------+------+-------------+
|     2|female|         70.0|
|     2|  male|         17.0|
|     3|  male|         47.0|
|     1|  male|         45.0|
|     1|female|         91.0|
|     3|female|         72.0|
+------+------+-------------+

In [11]:
# 8)
# Desenvolva sua resposta aqui:
# abaixo de 18 = criança, entre 18 e 40 = jovem adulto, maior de 40 = adulto maduro
df_titanic = df_titanic.withColumn('Age', col('Age').cast('float')) # para exibir >> .printSchema()

from pyspark.sql.functions import when
df_titanic = df_titanic.withColumn('Age', \
                      when(df_titanic['Age']<18, 'criança')\
                      .when(df_titanic['Age']==18, 'jovem adulto')\
                      .when(df_titanic['Age']<=40 , 'jovem adulto')\
                      .when(df_titanic['Age']>40 , 'adulto maduro')
                      .otherwise(df_titanic['Age']))
table_categ = df_titanic.groupBy('Sex', 'Age').count().show()

+------+-------------+-----+
|   Sex|          Age|count|
+------+-------------+-----+
|female|adulto maduro|   48|
|  male|      criança|   58|
|female|         null|   53|
|female| jovem adulto|  158|
|  male| jovem adulto|  293|
|  male|         null|  124|
|  male|adulto maduro|  102|
|female|      criança|   55|
+------+-------------+-----+

## 03 - Escreve dados

Faça uma seleção apenas das pessoas que sobreviveram e escreva os dados em um arquivo **parquet** particionado por sexo e classe.

In [32]:
# Desenvolva a resposta aqui...
from pyspark.sql import Row

df_titanic = spark.read.csv('file:///'+SparkFiles.get('titanic.csv'), header=True, sep=';')
df_titanic = df_titanic.filter('Survived=1')

titanic_parquet = df_titanic.write.partitionBy("Pclass","Sex").mode("overwrite").parquet("/Users/anacr/onboarding-ed-a3data/3-spark/titanic.parquet")

#Ex.: Consulta Pclass=1 Sex=male
titanic_parquet = spark.read.parquet("/Users/anacr/onboarding-ed-a3data/3-spark/titanic.parquet/Pclass=1/Sex=male")
titanic_parquet.show(truncate=False)

+-----------+--------+-------------------------------------------------+----+-----+-----+--------+-------+-------+--------+
|PassengerId|Survived|Name                                             |Age |SibSp|Parch|Ticket  |Fare   |Cabin  |Embarked|
+-----------+--------+-------------------------------------------------+----+-----+-----+--------+-------+-------+--------+
|24         |1       |Sloper, Mr. William Thompson                     |28.0|0    |0    |113788  |35.5   |A6     |S       |
|56         |1       |Woolner, Mr. Hugh                                |null|0    |0    |19947   |35.5   |C52    |S       |
|98         |1       |Greenfield, Mr. William Bertram                  |23.0|0    |1    |PC 17759|63.3583|D10 D12|C       |
|188        |1       |"Romaine, Mr. Charles Hallace (""Mr C Rolmane"")"|45.0|0    |0    |111428  |26.55  |null   |S       |
|210        |1       |Blank, Mr. Henry                                 |40.0|0    |0    |112277  |31.0   |A31    |C       |
|225        |1       |Hoyt, Mr. Frederick Maxfield                     |38.0|1    |0    |19943   |90.0   |C93    |S       |
|249        |1       |Beckwith, Mr. Richard Leonard                    |37.0|1    |1    |11751   |52.5542|D35    |S       |
|299        |1       |Saalfeld, Mr. Adolphe                            |null|0    |0    |19988   |30.5   |C106   |S       |
|306        |1       |Allison, Master. Hudson Trevor                   |0.92|1    |2    |113781  |151.55 |C22 C26|S       |
|371        |1       |Harder, Mr. George Achilles                      |25.0|1    |0    |11765   |55.4417|E50    |C       |
|391        |1       |Carter, Mr. William Ernest                       |36.0|1    |2    |113760  |120.0  |B96 B98|S       |
|431        |1       |Bjornstrom-Steffansson, Mr. Mauritz Hakan        |28.0|0    |0    |110564  |26.55  |C52    |S       |
|446        |1       |Dodge, Master. Washington                        |4.0 |0    |2    |33638   |81.8583|A34    |S       |
|448        |1       |Seward, Mr. Frederic Kimber                      |34.0|0    |0    |113794  |26.55  |null   |S       |
|450        |1       |Peuchen, Major. Arthur Godfrey                   |52.0|0    |0    |113786  |30.5   |C104   |S       |
|454        |1       |Goldenberg, Mr. Samuel L                         |49.0|1    |0    |17453   |89.1042|C92    |C       |
|461        |1       |Anderson, Mr. Harry                              |48.0|0    |0    |19952   |26.55  |E12    |S       |
|485        |1       |Bishop, Mr. Dickinson H                          |25.0|1    |0    |11967   |91.0792|B49    |C       |
|508        |1       |"Bradley, Mr. George (""George Arthur Brayton"")"|null|0    |0    |111427  |26.55  |null   |S       |
|513        |1       |McGough, Mr. James Robert                        |36.0|0    |0    |PC 17473|26.2875|E25    |S       |
+-----------+--------+-------------------------------------------------+----+-----+-----+--------+-------+-------+--------+
only showing top 20 rows